Revit.GeometryConversion.ProtoToRevitSolid.GetSolidsFromElement(Autodesk.Revit.DB.Element)
Get Solids from Element
element:
Returns:

Revit.GeometryConversion.ProtoToRevitSolid.ApplyMaterialToFreeForm(Autodesk.Revit.DB.Document,Revit.Elements.Material,Autodesk.Revit.DB.FreeFormElement)
Apply Material to Solid
familyDocument:
material:
element:

Revit.GeometryConversion.ProtoToRevitSolid.ApplySubCategoryToFreeForm(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.FreeFormElement)
Apply SubCategory to Solid
familyDocument:
subcategory:
freeform:

Revit.GeometryConversion.ProtoToRevitSolid.ApplyVoidSettingsToFreeForm(Autodesk.Revit.DB.FreeFormElement)
Apply Cutting Settings to Void
freeform:

Revit.GeometryConversion.ProtoToRevitSolid.ToRevitFamilyType(Autodesk.DesignScript.Geometry.Solid,System.String,Revit.Elements.Category,System.String,Revit.Elements.Material,System.Boolean,System.String)
Convert a DS Solid to a Revit FamilySymbol containing
Revit FreeForms via SAT Export/Import
solidGeometry:
name:
category:
templatePath: Revit Template to use for Family Creation
material: Can be null for Voids
isVoid: Create Void
subcategory: Can be string.Empty for Voids
Returns: